tobozo/Arduino/boards.txt
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.UploadTool=Upload Using
menu.ResetMethod=Reset Method


##############################################################
dstike.name=DSTIKE by Travis Lin

dstike.upload.tool=esptool
dstike.upload.speed=115200
dstike.upload.resetmethod=nodemcu
dstike.upload.maximum_size=1044464
dstike.upload.maximum_data_size=81920
dstike.upload.wait_for_upload_port=true
dstike.serial.disableDTR=true
dstike.serial.disableRTS=true

dstike.build.mcu=esp8266
dstike.build.f_cpu=160000000L
dstike.build.board=ESP8266_ESP07
dstike.build.core=esp8266
dstike.build.variant=dstike
dstike.build.flash_mode=qio
dstike.build.spiffs_pagesize=256
dstike.build.flash_size=1M
dstike.build.flash_freq=80

dstike.menu.UploadTool.esptool=Serial
dstike.menu.UploadTool.esptool.upload.tool=esptool
dstike.menu.UploadTool.esptool.upload.verbose=-vv
dstike.menu.UploadTool.espota=OTA
dstike.menu.UploadTool.espota.upload.tool=espota

dstike.menu.CpuFrequency.160=160 MHz
dstike.menu.CpuFrequency.160.build.f_cpu=160000000L
dstike.menu.CpuFrequency.80=80 MHz
dstike.menu.CpuFrequency.80.build.f_cpu=80000000L

dstike.menu.FlashFreq.80=80MHz
dstike.menu.FlashFreq.80.build.flash_freq=80
dstike.menu.FlashFreq.40=40MHz
dstike.menu.FlashFreq.40.build.flash_freq=40

dstike.menu.FlashMode.dio=DIO
dstike.menu.FlashMode.dio.build.flash_mode=dio
dstike.menu.FlashMode.qio=QIO
dstike.menu.FlashMode.qio.build.flash_mode=qio

dstike.menu.UploadSpeed.115200=115200
dstike.menu.UploadSpeed.115200.upload.speed=115200
dstike.menu.UploadSpeed.9600=9600
dstike.menu.UploadSpeed.9600.upload.speed=9600
dstike.menu.UploadSpeed.57600=57600
dstike.menu.UploadSpeed.57600.upload.speed=57600
dstike.menu.UploadSpeed.256000=256000
dstike.menu.UploadSpeed.256000.upload.speed=256000
dstike.menu.UploadSpeed.921600=921600
dstike.menu.UploadSpeed.921600.upload.speed=921600

dstike.menu.FlashSize.1M256=1M (256K SPIFFS)
dstike.menu.FlashSize.1M256.build.flash_size=1M
dstike.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
dstike.menu.FlashSize.1M256.build.spiffs_start=0xBB000
dstike.menu.FlashSize.1M256.build.spiffs_end=0xFB000
dstike.menu.FlashSize.1M256.build.spiffs_blocksize=4096
dstike.menu.FlashSize.1M256.upload.maximum_size=761840

dstike.menu.FlashSize.1M512=1M (512K SPIFFS)
dstike.menu.FlashSize.1M512.build.flash_size=1M
dstike.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
dstike.menu.FlashSize.1M512.build.spiffs_start=0x7B000
dstike.menu.FlashSize.1M512.build.spiffs_end=0xFB000
dstike.menu.FlashSize.1M512.build.spiffs_blocksize=8192
dstike.menu.FlashSize.1M512.upload.maximum_size=499696

dstike.menu.FlashSize.4M3M=4M (3M SPIFFS)
dstike.menu.FlashSize.4M3M.build.flash_size=4M
dstike.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
dstike.menu.FlashSize.4M3M.build.spiffs_start=0x100000
dstike.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
dstike.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
dstike.menu.FlashSize.4M3M.build.spiffs_pagesize=256

dstike.menu.FlashSize.4M1M=4M (1M SPIFFS)
dstike.menu.FlashSize.4M1M.build.flash_size=4M
dstike.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
dstike.menu.FlashSize.4M1M.build.spiffs_start=0x300000
dstike.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
dstike.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
dstike.menu.FlashSize.4M1M.build.spiffs_pagesize=256

dstike.menu.ResetMethod.nodemcu=nodemcu
dstike.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
dstike.menu.ResetMethod.ck=ck
dstike.menu.ResetMethod.ck.upload.resetmethod=ck




##############################################################
nodemcuv2.name=NodeMCU (ESP-12 Module)

nodemcuv2.upload.tool=esptool
nodemcuv2.upload.speed=115200
nodemcuv2.upload.resetmethod=nodemcu
nodemcuv2.upload.maximum_size=1044464
nodemcuv2.upload.maximum_data_size=81920
nodemcuv2.upload.wait_for_upload_port=true
nodemcuv2.serial.disableDTR=true
nodemcuv2.serial.disableRTS=true

nodemcuv2.build.mcu=esp8266
nodemcuv2.build.f_cpu=160000000L
nodemcuv2.build.board=ESP8266_ESP12
nodemcuv2.build.core=esp8266
nodemcuv2.build.variant=nodemcu
nodemcuv2.build.flash_mode=dio
nodemcuv2.build.spiffs_pagesize=256
nodemcuv2.build.flash_size=1M
nodemcuv2.build.flash_freq=80

nodemcuv2.menu.CpuFrequency.160=160 MHz
nodemcuv2.menu.CpuFrequency.160.build.f_cpu=160000000L
nodemcuv2.menu.CpuFrequency.80=80 MHz
nodemcuv2.menu.CpuFrequency.80.build.f_cpu=80000000L

nodemcuv2.menu.UploadTool.esptool=Serial
nodemcuv2.menu.UploadTool.esptool.upload.tool=esptool
nodemcuv2.menu.UploadTool.esptool.upload.verbose=-vv
nodemcuv2.menu.UploadTool.espota=OTA
nodemcuv2.menu.UploadTool.espota.upload.tool=espota

nodemcuv2.menu.FlashFreq.80=80MHz
nodemcuv2.menu.FlashFreq.80.build.flash_freq=80
nodemcuv2.menu.FlashFreq.40=40MHz
nodemcuv2.menu.FlashFreq.40.build.flash_freq=40

nodemcuv2.menu.FlashMode.dio=DIO
nodemcuv2.menu.FlashMode.dio.build.flash_mode=dio
nodemcuv2.menu.FlashMode.qio=QIO
nodemcuv2.menu.FlashMode.qio.build.flash_mode=qio

nodemcuv2.menu.UploadSpeed.115200=115200
nodemcuv2.menu.UploadSpeed.115200.upload.speed=115200
nodemcuv2.menu.UploadSpeed.9600=9600
nodemcuv2.menu.UploadSpeed.9600.upload.speed=9600
nodemcuv2.menu.UploadSpeed.57600=57600
nodemcuv2.menu.UploadSpeed.57600.upload.speed=57600
nodemcuv2.menu.UploadSpeed.256000=256000
nodemcuv2.menu.UploadSpeed.256000.upload.speed=256000
nodemcuv2.menu.UploadSpeed.921600=921600
nodemcuv2.menu.UploadSpeed.921600.upload.speed=921600

nodemcuv2.menu.FlashSize.1M256=1M (256K SPIFFS)
nodemcuv2.menu.FlashSize.1M256.build.flash_size=1M
nodemcuv2.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
nodemcuv2.menu.FlashSize.1M256.build.spiffs_start=0xBB000
nodemcuv2.menu.FlashSize.1M256.build.spiffs_end=0xFB000
nodemcuv2.menu.FlashSize.1M256.build.spiffs_blocksize=4096
nodemcuv2.menu.FlashSize.1M256.upload.maximum_size=761840

nodemcuv2.menu.FlashSize.1M512=1M (512K SPIFFS)
nodemcuv2.menu.FlashSize.1M512.build.flash_size=1M
nodemcuv2.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
nodemcuv2.menu.FlashSize.1M512.build.spiffs_start=0x7B000
nodemcuv2.menu.FlashSize.1M512.build.spiffs_end=0xFB000
nodemcuv2.menu.FlashSize.1M512.build.spiffs_blocksize=8192
nodemcuv2.menu.FlashSize.1M512.upload.maximum_size=499696

nodemcuv2.menu.FlashSize.4M3M=4M (3M SPIFFS)
nodemcuv2.menu.FlashSize.4M3M.build.flash_size=4M
nodemcuv2.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
nodemcuv2.menu.FlashSize.4M3M.build.spiffs_start=0x100000
nodemcuv2.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
nodemcuv2.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
nodemcuv2.menu.FlashSize.4M3M.build.spiffs_pagesize=256

nodemcuv2.menu.FlashSize.4M1M=4M (1M SPIFFS)
nodemcuv2.menu.FlashSize.4M1M.build.flash_size=4M
nodemcuv2.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
nodemcuv2.menu.FlashSize.4M1M.build.spiffs_start=0x300000
nodemcuv2.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
nodemcuv2.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
nodemcuv2.menu.FlashSize.4M1M.build.spiffs_pagesize=256



